app/controllers/altars_controller.rb

SELECT "altars".* FROM "altars"
---
  def index
    @altars = Altar.all

INSERT INTO "altars" ("name", "user_id", "privacy", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Plutonical Saints"], ["user_id", 30], ["privacy", false], ["created_at", "2021-10-05 03:11:26.723519"], ["updated_at", "2021-10-05 03:11:26.723519"]]
---
  def create
    @altar = Altar.new(altar_params)

    if @altar.save

UPDATE "altars" SET "name" = $1, "updated_at" = $2 WHERE "altars"."id" = $3  [["name", "Cyber Angelair"], ["updated_at", "2021-10-05 03:32:23.212376"], ["id", 109]]
---
  def update
    if @altar.update(altar_params)

DELETE FROM "altars" WHERE "altars"."id" = $1  [["id", 153]]
---
  def destroy
    @altar.destroy

SELECT "altars".* FROM "altars" WHERE "altars"."id" = $1 LIMIT $2  [["id", 116], ["LIMIT", 1]]
---
    def set_altar
      @altar = Altar.find(params[:id])