app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)

    if @image.save
---
INSERT INTO "images" ("name", "image_type", "top", "left", "altar_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Tina"], ["image_type", 25], ["top", "10"], ["left", "17"], ["altar_id", 158], ["created_at", "2021-10-09 18:55:56.429094"], ["updated_at", "2021-10-09 18:55:56.429094"]]

  def update
    if @image.update(image_params)
---
UPDATE "images" SET "top" = $1, "left" = $2, "updated_at" = $3 WHERE "images"."id" = $4  [["top", "226"], ["left", "61"], ["updated_at", "2021-10-09 23:37:39.928504"], ["id", 38]]

  def destroy
    @image.destroy
---
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 38]]